2021-03-06-关于dashboard中recent-files的问题.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://fieryzig.github.io/rss.xml"
      title="RSS feed for https://fieryzig.github.io">
<title>关于dashboard中recent files的问题</title>
<meta name="author" content="fieryzig">
<meta name="referrer" content="no-referrer">
<link href="static/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="preamble" class="status"><div class="header">
<h1><a href="https://fieryzig.github.io" class="title">Les Frites</a></h1>
<p class="text-muted">fieryzig's blog</p>
<ul class="list-inline">
<li class="list-inline-item"><a href="https://fieryzig.github.io/about.html">About</a></li>
<li class="list-inline-item"><a href="https://fieryzig.github.io/tags.html">Tags</a></li>
</ul>
</div></div>
<div id="content">
<div class="post-date">06 Mar 2021</div><h1 class="post-title"><a href="https://fieryzig.github.io/2021-03-06-关于dashboard中recent-files的问题.html">关于dashboard中recent files的问题</a></h1>
<p>
最近在使用dashboard的时候，发现了一个不完美的地方，就是经常发现Recent Files里面会出现Org Agenda相关的文件。这些文件占据了Recent Files的位置，导致无法显示出我真正想要的最近文件。
搜索了一下，发现<a href="https://github.com/emacs-dashboard/emacs-dashboard">dashboard</a>的issues里面已经有了相关的问题，并且！已经有<a href="https://github.com/emacs-dashboard/emacs-dashboard/pull/83">PR</a>修复了这个问题！
看来事情并不是这么简单。
</p>

<div id="outline-container-orgb406e74" class="outline-2">
<h2 id="orgb406e74">问题的复现</h2>
<div class="outline-text-2" id="text-orgb406e74">
<p>
因为自己只是在日常使用中经常遇到这个问题，并没有留意发生的条件，所以问题的第一步是复现这个问题。
</p>

<p>
首先发现重新启动Emacs显示的结果是正确的（Recent Files里面没有Org文件）
</p>

<p>
由于我的Emacs里面配置了 <code>tempbuf</code> ，所以10s钟后会自动kill掉org的buffer。
</p>

<p>
经过多次实验，我发现，10s前我在dashboard按 <code>g</code> ，刷新dashboard，显示正确。但是10s后（即org buffer被kill后），Recent Files里面就会出现Org文件。
</p>

<p>
一个问题此时变成了多个问题：
</p>

<ul class="org-ul">
<li>为什么org buffer被kill后，刷新dashboard会显示错误？</li>
<li>为什么启动Emacs又是正确的？</li>
<li>怎么解决这个问题？怎么让dashboard一直显示正确？</li>
</ul>
</div>
</div>

<div id="outline-container-org85591b8" class="outline-2">
<h2 id="org85591b8">继续探究</h2>
<div class="outline-text-2" id="text-org85591b8">
</div>
<div id="outline-container-org793d37d" class="outline-3">
<h3 id="org793d37d">从dashboard出发</h3>
<div class="outline-text-3" id="text-org793d37d">
<p>
dashboard照理说已经修复了这个问题，我们先来看看PR83究竟是怎么修复的。
重点就在 <code>dashboard-insert-startupify-lists</code> 这个函数里
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">dashboard-insert-startupify-lists</span> ()
  <span style="font-style: italic;">"Insert the list of widgets into the buffer."</span>
  (<span style="font-weight: bold;">interactive</span>)
  (<span style="font-weight: bold;">let</span> ((buffer-exists (buffer-live-p (get-buffer dashboard-buffer-name)))
        (recentf-is-on (recentf-enabled-p))
        (origial-recentf-list recentf-list)
        (dashboard-num-recents (<span style="font-weight: bold;">or</span> (cdr (assoc 'recents dashboard-items)) 0))
        (max-line-length 0))
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">disable recentf mode,</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">so we don't flood the recent files list with org mode files</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">do this by making a copy of the part of the list we'll use</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">let dashboard widgets change that</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">then restore the orginal list afterwards</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(this avoids many saves/loads that would result from</span>
    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">disabling/enabling recentf-mode)</span>
    (<span style="font-weight: bold;">when</span> recentf-is-on
      (<span style="font-weight: bold;">setq</span> recentf-list (seq-take recentf-list dashboard-num-recents)))
    (<span style="font-weight: bold;">when</span> (<span style="font-weight: bold;">or</span> (not (eq dashboard-buffer-last-width (window-width)))
              (not buffer-exists))
      (<span style="font-weight: bold;">setq</span> dashboard-banner-length (window-width)
            dashboard-buffer-last-width dashboard-banner-length)
      (<span style="font-weight: bold;">with-current-buffer</span> (get-buffer-create dashboard-buffer-name)
        (<span style="font-weight: bold;">let</span> ((buffer-read-only nil))
          (erase-buffer)
          (dashboard-insert-banner)
          (dashboard-insert-page-break)
          (<span style="font-weight: bold;">setq</span> dashboard--section-starts nil)
          (mapc (<span style="font-weight: bold;">lambda</span> (els)
                  (<span style="font-weight: bold;">let*</span> ((el (<span style="font-weight: bold;">or</span> (car-safe els) els))
                         (list-size
                          (<span style="font-weight: bold;">or</span> (cdr-safe els)
                              dashboard-items-default-length))
                         (item-generator
                          (cdr-safe (assoc el dashboard-item-generators))))
                    (add-to-list 'dashboard--section-starts (point))
                    (funcall item-generator list-size)
                    (<span style="font-weight: bold;">when</span> recentf-is-on
                      (<span style="font-weight: bold;">setq</span> recentf-list origial-recentf-list))
                    (<span style="font-weight: bold;">setq</span> max-line-length
                          (max max-line-length (dashboard-maximum-section-length)))
                    (dashboard-insert-page-break)))
                dashboard-items)
          (<span style="font-weight: bold;">when</span> dashboard-center-content
            (<span style="font-weight: bold;">when</span> dashboard--section-starts
              (goto-char (car (last dashboard--section-starts))))
            (<span style="font-weight: bold;">let</span> ((margin (floor (/ (max (- (window-width) max-line-length) 0) 2))))
              (<span style="font-weight: bold;">while</span> (not (eobp))
                (<span style="font-weight: bold;">unless</span> (string-suffix-p (thing-at-point 'line) dashboard-page-separator)
                  (insert (make-string margin ?\ )))
                (forward-line 1))))
          (dashboard-insert-footer))
        (goto-char (point-min))
        (dashboard-mode)))
    (<span style="font-weight: bold;">when</span> recentf-is-on
      (<span style="font-weight: bold;">setq</span> recentf-list origial-recentf-list))))
</pre>
</div>

<p>
从中间的注释中可以看出，是先用 <code>origial-recentf-list</code> 将 <code>recentf-list</code> 记录下来，在最后再复原回去。
</p>

<p>
看起来好像没什么不对的。但是既然不对了，说明一定是 <code>recentf-list</code> 这个变量出了问题。并且 <code>kill-buffer</code> 之前没问题， <code>kill-buffer</code> 之后出了问题，是不是 <code>kill-buffer</code> 的时候改变了 <code>recentf-list</code> 呢
</p>
</div>
</div>

<div id="outline-container-org952346f" class="outline-3">
<h3 id="org952346f">到recentf中去</h3>
<div class="outline-text-3" id="text-org952346f">
<p>
<a href="https://gitlab.com/basil-conto/emacs/blob/master/lisp/recentf.el#L1030">点这里</a>看recentf源码
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defconst</span> <span style="font-weight: bold; font-style: italic;">recentf-used-hooks</span>
  '(
    (find-file-hook       recentf-track-opened-file)
    (write-file-functions recentf-track-opened-file)
    (kill-buffer-hook     recentf-track-closed-file)
    (kill-emacs-hook      recentf-save-list)
    )
  <span style="font-style: italic;">"Hooks used by recentf."</span>)
</pre>
</div>

<p>
从这里可以看出它的逻辑是 <code>find-file</code> 和 <code>write-file</code> 的时候，将文件放入 <code>recentf-list</code> 中； <code>kill-buffer</code> 的时候将文件从 <code>recentf-list</code> 中删除；退出Emacs的时候将 <code>recentf-list</code> 写入文件。
</p>

<p>
看来这里也没什么问题。那问题究竟出在哪里？
</p>
</div>
</div>

<div id="outline-container-orgdeccc9b" class="outline-3">
<h3 id="orgdeccc9b">一个猜想</h3>
<div class="outline-text-3" id="text-orgdeccc9b">
<p>
先不考虑第一次启动Emacs的话，问题变得简单了一些。存在org文件buffer的时候，刷新dashbaord没问题。不存在org文件buffer的时候，刷新dashboard就会出错。所以，一定是刷新dashbaord的时候，agenda会打开org文件，如果org文件已经在buffer中了，就不会 <code>find-file</code> ；否则调用 <code>find-file</code> 就会触发 <code>recentf-track-opened-file</code> ，将文件加入到 <code>recentf-list</code> 中。
</p>

<p>
但是每次在刷新dashboard之后（无论是否正确），我将 <code>recentf-list</code> 打印出来，结果都是不包含org文件的。这应该是dashboard刷新后，用之前的origial的复原了 <code>recentf-list</code> 。
</p>

<p>
也就是 <code>recentf-list</code> 刷新之前和刷新之后都是好的。而最终展现的Recent Files却是错的。
</p>

<p>
真相只有一个了，那就是生成Recent Files的时候，用的 <code>recentf-list</code> 是错的。
</p>
</div>
</div>

<div id="outline-container-orgbc98b5b" class="outline-3">
<h3 id="orgbc98b5b">深入dashboard-widgets</h3>
<div class="outline-text-3" id="text-orgbc98b5b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">dashboard-insert-recents</span> (list-size)
  <span style="font-style: italic;">"Add the list of LIST-SIZE items from recently edited files."</span>
  (<span style="font-weight: bold;">setq</span> dashboard--recentf-cache-item-format nil)
  (recentf-mode)
  (<span style="font-weight: bold;">let</span> ((inhibit-message t) (message-log-max nil))
    (recentf-cleanup))
  (dashboard-insert-section
   <span style="font-style: italic;">"Recent Files:"</span>
   (dashboard-shorten-paths recentf-list 'dashboard-recentf-alist)
   list-size
   (dashboard-get-shortcut 'recents)
   `(<span style="font-weight: bold;">lambda</span> (<span style="font-weight: bold; text-decoration: underline;">&amp;rest</span> ignore)
      (find-file-existing (dashboard-expand-path-alist ,el dashboard-recentf-alist)))
   (<span style="font-weight: bold;">let*</span> ((file (dashboard-expand-path-alist el dashboard-recentf-alist))
          (filename (dashboard-f-filename file))
          (path (dashboard-extract-key-path-alist el dashboard-recentf-alist)))
     (<span style="font-weight: bold;">cl-case</span> dashboard-recentf-show-base
       (align
        (<span style="font-weight: bold;">unless</span> dashboard--recentf-cache-item-format
          (<span style="font-weight: bold;">let*</span> ((len-align (dashboard--get-align-length dashboard-recentf-alist))
                 (new-fmt (dashboard--generate-align-format
                           dashboard-recentf-item-format len-align)))
            (<span style="font-weight: bold;">setq</span> dashboard--recentf-cache-item-format new-fmt)))
        (format dashboard--recentf-cache-item-format filename path))
       (nil (format dashboard-recentf-item-format filename path))
       (t path)))))
</pre>
</div>

<p>
在这里我们终于发现 <code>recentf-list</code> 。而这时的 <code>recentf-list</code> 应该是没有复原过的。所以才会输出错误的结果。
</p>

<p>
在这里，我们还注意到 <code>(recentf-mode)</code> 。也就是说 <code>recentf-mode</code> 是在这里启动的。这也是为什么重新启动Emacs显示正确的原因。因为dashboard先处理Agenda的org文件，此时还没有开启recentf-mode，所以结果是对的。
</p>

<p>
为了验证这一点，我将 <code>dashbaord-items</code> 里面的顺序调整了一下，把recentf放在agenda的前面。果然，再次启动Emacs，结果也是错误的。
</p>
</div>
</div>
</div>

<div id="outline-container-orgcc6fd8e" class="outline-2">
<h2 id="orgcc6fd8e">结论</h2>
<div class="outline-text-2" id="text-orgcc6fd8e">
<p>
所以，这个<a href="https://github.com/emacs-dashboard/emacs-dashboard/pull/83/">PR</a>压根没有修复Recent Files显示Agenda org files这个issue。它只在同时满足 <b>首次启动Emacs</b> 和 <b>agenda在recentf前面</b> 这两个条件时，它才会Work。
</p>

<p>
最后说一下我的解决方案：
</p>
</div>

<div id="outline-container-orga28fd1f" class="outline-3">
<h3 id="orga28fd1f">1.修改dashboard的逻辑</h3>
<div class="outline-text-3" id="text-orga28fd1f">
<p>
在上面dashboard的代码中加两行，作用是每次完成一个item之后，都复原一次 <code>recentf-list</code> 。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(mapc (<span style="font-weight: bold;">lambda</span> (els)
        (<span style="font-weight: bold;">let*</span> ((el (<span style="font-weight: bold;">or</span> (car-safe els) els))
               (list-size
                (<span style="font-weight: bold;">or</span> (cdr-safe els)
                    dashboard-items-default-length))
               (item-generator
                (cdr-safe (assoc el dashboard-item-generators))))
          (add-to-list 'dashboard--section-starts (point))
          (funcall item-generator list-size)
          (<span style="font-weight: bold;">when</span> recentf-is-on
            (<span style="font-weight: bold;">setq</span> recentf-list origial-recentf-list))
          (<span style="font-weight: bold;">setq</span> max-line-length
                (max max-line-length (dashboard-maximum-section-length)))
          (dashboard-insert-page-break)))
      dashboard-items)
</pre>
</div>
<p>
这个方法，好处是简单容易，效率高，缺点是修改了dashboard，在代码没被合到master之前会比较难受。
</p>
</div>
</div>

<div id="outline-container-orgef7735d" class="outline-3">
<h3 id="orgef7735d">2.重新定义g按键</h3>
<div class="outline-text-3" id="text-orgef7735d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(define-key dashboard-mode-map (kbd <span style="font-style: italic;">"g"</span>) #'my-dashboard-g)
</pre>
</div>

<p>
<code>my-dashboard-g</code> 的实现有两种思路，一是在refresh之前，把recentf-mode关闭了。这个方法的缺点在上面的PR里面的注释里说道了，就是读写文件，效率差。二是直接refresh两次，因为第一次refresh的时候org文件的buffer是不在的，所以错了，第二次时org文件的buffer的文件还在，因此结果是正确的。
</p>

<p>
重新定义g按键的方法，并没有修复问题，只是看起来ok的trick，并且只能agenda在recentf的前面。
</p>

<p>
因此还是推荐第1种做法，改日有时间提个PR吧。
</p>
</div>
</div>
</div>
<div class="taglist"><a href="https://fieryzig.github.io/tags.html">Tags</a>: <a href="https://fieryzig.github.io/tag-emacs.html">Emacs</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
